title: "Detect Process Creation with Hidden Attributes"
description: "Detects process creation events where the 'Hidden' attribute is set, indicating potential attempts to conceal malicious activity. "
id: ad698eee-696e-4509-806e-912bbf6c2e9a
status: "experimental"
author: "salimovone"
date: 2025-05-25
references:
    - "https://github.com/aktechnohacker/Ransomware-samples/tree/main/WannaCry"

logsource:
  product: windows
  service: sysmon
  category: process_creation
  definition: "This rule detects process creation events where the 'Hidden' attribute is set using the attrib.exe utility, which is commonly used to manipulate file attributes in Windows."
detection:
  selection:
    Image: "C:\\Windows\\SysWOW64\\attrib.exe"
    CommandLine|contains: "+h"
  filter:
    ParentImage|endswith:
      - "C:\\Windows\\System32\\cmd.exe"
      - "C:\\Windows\\System32\\powershell.exe"
      - "explorer.exe"
      - "task scheduler"
      - "schtasks.exe"
      - "wscript.exe"
      - "cscript.exe"
  condition: selection and not filter

level: medium
tags:
  - attack.t1055
  - attack.t1027